/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 📄 الملف: pipe.ts
 * 📂 المسار: packages/core/src/utils/pipe.ts
 * 🎯 الهدف الرئيسي: دالة أساسية لتسلسل تحويلات وظيفية نقية (Pipeline).
 *    تُستخدم لتركيب الدوال الصغيرة في خط أنابيب واحد واضح وقابل للصيانة.
 * 📋 المعايير:
 *    - صفر اعتماديات خارجية.
 *    - كل دالة في الخط أنابيب يجب أن تكون نقية (لا تأثيرات جانبية).
 *    - يجب أن تحتوي على أقل من 10 أسطر.
 * 🧪 الاختبارات: packages/core/tests/utils/pipe.test.ts
 * 🏷️ المعرف: CORE-012
 * 📅 تاريخ الإنشاء: 2026-08-20
 * ═══════════════════════════════════════════════════════════════════════════
 * 🧠 الطريقة المبتكرة | Innovative Pattern:
 *    Left-to-Right Functional Pipeline Composition
 * ⚠️ نقاط الخطر الإلزامية | Mandatory Gotchas:
 *    1. عدم وضع دوال بها تأثيرات جانبية (Side Effects) داخل الخط أنابيب.
 * ═══════════════════════════════════════════════════════════════════════════
 * 👤 المالك: Hossam El-Din Abdel-Moaty El-Khouly - All rights reserved
 * ⚖️ الترخيص: MIT License
 * 📚 المصادر المقتبسة: Valibot Pipeline Pattern
 * ═══════════════════════════════════════════════════════════════════════════
 */

export function pipe<T>(value: T, ...fns: ReadonlyArray<(v: T) => T>): T {
  let result = value;
  for (const fn of fns) {
    result = fn(result);
  }
  return result;
}
