/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 📄 الملف: index.ts
 * 📂 المسار: packages/algorithms/src/search/index.ts
 * 🎯 الهدف الرئيسي: تصدير محرك وأنواع البحث والاستبدال المتقدم
 * 📋 المعايير: Barrel Export
 * 🏷️ المعرف: ALGO-033
 * 📅 تاريخ الإنشاء: 2026-08-20
 * 👤 المالك: Hossam El-Din Abdel-Moaty El-Khouly - All rights reserved
 * ⚖️ الترخيص: MIT License
 * ═══════════════════════════════════════════════════════════════════════════
 */

export * from './types';
export * from './find-replace-engine';
