/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 📄 الملف: index.ts
 * 📂 المسار: packages/algorithms/src/vector/index.ts
 * 🎯 الهدف الرئيسي: Barrel Export لمحركات المتجهات والتفاعل
 * 📋 المعايير: تصدير جميع الأنواع والدوال العامة
 * 🏷️ المعرف: ALGO-037
 * 📅 تاريخ الإنشاء: 2026-08-21
 * ═══════════════════════════════════════════════════════════════════════════
 * ©️ جميع الحقوق محفوظة ©️ - 2026
 * ═══════════════════════════════════════════════════════════════════════════
 */

export * from './common';
export * from './coordinate-system';
export * from './mouse-algorithms';
export * from './smart-alignment';
